<?php
// بدء الجلسة
session_start();

// التحقق إذا كان المستخدم مسجلاً للدخول
if (isset($_SESSION['user_id'])) {
    // إلغاء جميع المتغيرات الخاصة بالجلسة
    session_unset();
    
    // تدمير الجلسة
    session_destroy();
    
    // إعادة توجيه المستخدم إلى الصفحة الرئيسية أو صفحة تسجيل الدخول
    header("Location: login.php"); // أو يمكنك توجيههم إلى الصفحة الرئيسية مثل "index.php"
    exit();
} else {
    // إذا لم يكن المستخدم مسجلاً للدخول، يمكن توجيهه إلى صفحة تسجيل الدخول
    header("Location: login.php");
    exit();
}
?>